Repository: PerchunPak/PingerBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: Hello World!
ru: Привет Мир!
uk: Привіт Світ!

source: `uvloop` installed, speed increased.
ru: `uvloop` установлен, скорость увеличена.
uk: `uvloop` встановлено, швидкість збільшено.

source: Preparing and run the bot...
ru: Подготавливаем и запускаем бота...
uk: Підготовлюю та запускаю бота...

source: Pre-Run ended.
ru: Подготовка бота закончена.
uk: Підготовка закінчена.

source: ping-pong
ru: пинг-понг
uk: пінг-понг

source: Cannot resolve IP {} to number IP
ru: Не могу пропарсить IP {} в числовой IP
uk: Не можу пропарсити IP {} в цифровий IP

source: Starting DB...
ru: Запускаю базу данных...
uk: Запускаю базу даних...

source: Command '{}'
ru: Команда '{}'
uk: Команда '{}'

source: Bot running! For stop it, use CTRL C.
ru: Бот запущен! Для остановки нажмите CTRL C.
uk: Бот запущений! Для його зупинки натисніть CTRL C.

source: Bot stopping. Bye!
ru: Бот останавливается. Пока!
uk: Бот зупиняється. Бувайте!

source: Collecting info for statistic plot.
ru: Собираю статистику для построения графика.
uk: Збираю інформація для будівлі графіка статистики.

source: Deleting old pings.
ru: Удаляю старые пинги.
uk: Видаляю старі пінги.

source: Collecting info ended!
ru: Собирание информации закончилось!
uk: Збирання інформації закінчено!

source: Server offline?
ru: Сервер офлайн?
uk: Сервер офлайн?

source: Update max players, in server {}
ru: Обновление рекорда онлайна, в сервере {}
uk: Оновлення рекорда онлайна в сервері {}

source: Wait please...
ru: Пожалуйста подождите...
uk: Будь ласка почекайте...

source: I'm working on it, please wait. I will ping you when it's done.
ru: Я работаю над этим, пожалуйста подождите. Я вас упомяну когда закончу.
uk: Я працюю над цим, будь ласка почекайте. Я згадаю вас коли закінчу.

source: Cannot add server {}
ru: Не могу добавить сервер {}
uk: Не можу додати сервер {}

source: Can't ping the server.
ru: Не могу пингануть сервер.
uk: Не можу пінганути сервер.

source: Maybe you set invalid IP address, or server just offline.
ru: Возможно вы указали не правильный IP адрес, или сервер просто выключен.
uk: Можливо ви вказали не вірну IP адресу, або сервер просто вимкнений.

source: Server was already added.
ru: Сервер уже был добавлен.
uk: Сервер вже було додано.

source: Maybe you set invalid IP address.
ru: Возможно вы указали не правильный IP адрес.
uk: Можливо ви вказали не вірну IP адресу.

source: The IP address of the server.
ru: Айпи адрес сервера.
uk: Айпі адреса сервера.

source: Add server to database.
ru: Добавить сервер в базу данных.
uk: Додати сервер в базу даних.

source: Failed ping for {}
ru: Не удалось пингануть {}
uk: Не вдалося пінганути {}

source: Added server {}
ru: Добавлен сервер {}
uk: Додан сервер {}

source: Server {} already added
ru: Сервер {} уже был добавлен.
uk: Сервер {} вже було додано.

source: Name of the server in database: {}
ru: Имя сервера в базе данных: {}
uk: Им'я сервера в базі даних: {}

source: Server successfully added.
ru: Сервер был успешно добавлен.
uk: Сервер успішно додано.

source: See `/` preview for more info about commands to use.
ru: Смотрите `/` превью для большей информации про команды, и их использование.
uk: Дивіться `/` прев'ю для більшої інформації про команди, та їх використання.

source: Now you can use `/statistic {0}`, or a `/alias {0} (your alias)` command.
ru: Теперь вы можете использовать `/statistic {0}`, или `/alias {0} (ваш алиас) команду.
uk: Тепер ви можете використовувати `/statistic {0}`, або `/alias {0} (ваш аліас)` команду

source: Ping Results {}
ru: Результаты Пинга {}
uk: Результати Пінгу {}

source: You are not an owner of the server
ru: Вы не владелец сервера.
uk: Ви не власник цього серверу

source: Only server's owner can set/change alias.
ru: Только владелец сервера может устанавливать/изменять алиас.
uk: Тільки власник серверу може встановлювати/змінювати аліас.

source: Can't set alias.
ru: Не могу установить алиас.
uk: Не можу встановити аліас.

source: You are not owner of the server {}.
ru: Вы не владелец сервера {}.
uk: Ви не власник серверу {}.

source: For more information about the server, write: {}
ru: Для большей информации про сервер, напишите: {}
uk: Для більшої інформації про сервер, напишіть: {}

source: Alias {} already exists
ru: Алиас {} уже существует
uk: Аліас {} вже існує

source: You can add only not existing alias.
ru: Вы можете добавлять только не существующие алиасы.
uk: Ви можете встановити тільки не існуючий аліас.

source: Error
ru: Ошибка
uk: Помилка

source: Alias already exists.
ru: Алиас уже существует.
uk: Аліас вже існує.

source: The IP address or alias of the server.
ru: Айпи адрес или алиас сервера.
uk: Айпі адреса або аліас серверу.

source: New alias of the server.
ru: Новый алиас сервера.
uk: Новий аліас серверу.

source: Set alias of the server.
ru: Установить алиас сервера.
uk: Встановіть аліас сервера.

source: Server {} in DB {}
ru: Сервер {} в базе данных {}
uk: Сервер {} в базі даних {}

source: Failed add alias for {}.
ru: Не удалось добавить алиас для {}.
uk: Не вдалося додати аліас для {}.

source: Server offline or not in database.
ru: Сервер выключен или не в базе данных.
uk: Сервер офлайн, або не в базі даних.

source: User not owner.
ru: Пользователь не владелец.
uk: Користувач не власник.

source: Added alias {} to server {}
ru: Добавлен алиас {} к серверу {}
uk: Додан аліас {} до сервера {}

source: Now you can use {} instead of {}
ru: Теперь вы можете использовать {} вместо {}
uk: Ви тепер можете використовувати {} замість {}

source: Data successfully updated
ru: Сервер был успешно добавлен.
uk: Данні успішно оновлено.

source: See '/' preview for list of my commands
ru: Смотрите '/' превью для получения списка моих команд
uk: Дивіться `/` прев'ю для списку моїх команд

source: Detailed MOTD of the {}
ru: Детальное MOTD сервера {}
uk: Детальне MOTD сервера {}

source: Get link for editing the server MOTD.
ru: Дает ссылку на редактирование MOTD сервера.
uk: Дає посилання на редагування MOTD сервера.

source: This command give ability to edit the MOTD of the server.
ru: Эта команда дает возможность редактировать MOTD сервера.
uk: Ця команда дає можливість редагувати MOTD сервера.

source: Link for editing
ru: Ссылка для редактирования
uk: Посилання для редагування

source: Ping successful for {}
ru: Пинг удался для {}
uk: Пінг вдався для {}

source: Some basic information about me.
ru: Немного базовой информации про меня.
uk: Трохи базової інформації про мене.

source: Owner
ru: Владелец
uk: Власник

source: Programming language
ru: Язык программирования
uk: Мова програмування

source: Library
ru: Библиотека
uk: Бібліотека

source: License
ru: Лицензия
uk: Ліцензія

source: Source code
ru: Исходный код
uk: Джерельний код

source: Note: You can propose any changes to creator DM (Perchun_Pak#9236)
ru: Примечание: Вы можете предлагать любые изменения создателю в ЛС (Perchun_Pak#9236)
uk: Примітка: Ви можете пропонувати любі зміни розробнику в ПП (Perchun_Pak#9236)

source: Link for invite me.
ru: Ссылка что бы пригласить меня.
uk: Посилання на запрошення.

source: This is my invite link, so you can ping servers too:
ru: Это моя ссылка приглашения, так что вы можете пинговать сервера тоже:
uk: Це моє посилання на запрошення, так що ви можете пінгувати сервери також:

source: WARNING: Link only working if you an owner of this bot.
ru: ВНИМАНИЕ: Ссылка будет работать только если вы владелец этого бота.
uk: УВАГА: Посилання працює тільки якщо ви власник цього бота.

source: Owner of the server {}
ru: Владелец сервера {}.
uk: Власник серверу {}

source: Can't execute command.
ru: Не могу выполнить команду.
uk: Не вдається виконати команду.

source: Maybe you set invalid IP address, or server just not added.
ru: Возможно вы указали не правильный IP адрес, или сервер просто не был добавлен.
uk: Можливо ви вказали не вірну IP адресу, або сервер просто не був доданий.

source: Show owner of the server.
ru: Показывает владельца сервера.
uk: Ви не власник цього серверу.

source: Failed get server '{}' from database
ru: Не удалось получить сервер '{}' из базы данных.
uk: Не вдалося отримати сервер '{}' з бази даних.

source: It is {}
ru: Это {}
uk: Це {}

source: Bot's version
ru: Версия бота
uk: Версія бота

source: GIT not available
ru: GIT не доступен
uk: GIT недоступний

source: Unfortunately, bot can't get access to GIT.
ru: К сожалению, бот не может получить доступ к GIT
uk: На жаль, бот не може отримати доступ до GIT.

source: Show bot's version.
ru: Показывает версию бота.
uk: Показує версію бота.

source: Not available
ru: Не доступно
uk: Недоступно

source: Commit hash
ru: Хэш коммита
uk: Хеш коміта

source: Last version:
ru: Последняя версия:
uk: Остання версія:

source: SQL statement which I pass to database.
ru: SQL утверждение которое я передаю в базу данных.
uk: SQL твердження яке я передаю в базу даних.

source: Do I need use `.all()` on result.
ru: Нужно ли мне использовать `.all()` на результате.

source: Yes
ru: Да
uk: Так

source: No
ru: Нет
uk: Ні

source: Commit changes to database.
ru: Зафиксировать изменения в базе данных.
uk: Зафіксувати зміни в базі даних.

source: Execute SQL statement to database. **Owner-Only**.
ru: Выполняет SQL утверждение в базу данных. **Только для владельца**.
uk: Використовує SQL твердження в базу даних. **Тільки для власника**.

source: Done!
ru: Готово!
uk: Готово!

source: No info.
ru: Нет информации.
uk: Немає інформації.

source: Ping the server and give information about it.
ru: Пингует сервер и дает информацию про него.
uk: Пінгує сервер та дає інформацію про нього.

source: Number IP: {}
ru: Цифровой айпи: {}
uk: Цифровий айпі: {}

source: Latency
ru: Время Ответа
uk: Час Відповіді

source: Version
ru: Версия
uk: Версія

source: Players
ru: Игроки
uk: Гравці

source: If you want to get link for editing the server MOTD, use this command: {}
ru: Для получения ссылки на редактирование MOTD, напишите: {}
uk: Щоб отримати посилання на редактування MOTD, використайте: {}

source: {} statistic
ru: Статистика {}
uk: Статистика {}

source: Can't find the server in database.
ru: Не могу найти сервер в базе данных.
uk: Не можу знайти сервер в базі даних.

source: Time
ru: Время
uk: Час

source: Players online
ru: Игроков онлайн
uk: Гравців онлайн

source: Some statistic about the server.
ru: Немного статистики про сервер.
uk: Трохи статистики про сервер.

source: Server {} not found in database
ru: Сервер {} не найден в базе данных.
uk: Сервер {} не знайдено в базі даних.

source: Online
ru: Онлайн
uk: Онлайн

source: Offline
ru: Офлайн
uk: Офлайн

source: Current online
ru: Текущий онлайн
uk: Поточний онлайн

source: Yesterday online, in same time
ru: Онлайн вчера, в это же время
uk: Онлайн вчора, в той же час

source: Max online of all time
ru: Максимальный онлайн за все время
uk: Максимальний онлайн за весь час

source: not enough info for a plot.
ru: не достаточно информации для графика.
uk: Не достатньо інформації для графіка.
