Repository: PerchunPak/PingerBot
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru, uk_ua

source: Guides
ru: Гайды
uk_ua: Гайди

source: Pages
ru: Страницы
uk_ua: Сторінки

source: API Reference
ru: API Документация
uk_ua: API Документація

source: Build Status
ru: Статус Сборки
uk_ua: Статус Побудови

source: Documentation Build Status
ru: Статус Сборки Документации
uk_ua: Статус Побудови Документації

source: Code style: black
ru: Стиль Кода: black
uk_ua: Стиль коду: black

source: Python support versions badge
ru: Бейдж с поддерживаемыми версиями Python
uk_ua: Бейдж із підтримуваними версіями Python

source: Simple discord bot for tracking your MineCraft servers.
ru: Простой бот для отслеживания статуса и статистики своих MineCraft серверов.
uk_ua: Простий Discord бот для відстеження ваших MineCraft серверів.

source: `Документация на русском <https://pinger-bot.readthedocs.io/ru/latest>`_
ru: `Docs on English <https://pinger-bot.readthedocs.io/en/latest>`_

source: Features
ru: Особенности
uk_ua: Особливості

source: Free! We don't want any money from you!
ru: Бесплатно! Мы не попросим ни копейки за использование!
uk_ua: Безкоштовно! Ми не хочемо нічого від вас!

source: Self Hosted - Bot fully under your control!
ru: Само-Хостинг - Вы сами управляете ботом от начала и до конца!
uk_ua: Само-Хостинг - Бот повністю під вашим керуванням!

source: Installing
ru: Установка
uk_ua: Встановлення

source: Installing ``poetry``
ru: Установка ``poetry``
uk_ua: Встановлення ``poetry``

source: Next we need install ``poetry`` with `recomended way <https://python-poetry.org/docs/master/#installation>`_.
ru: Затем установите ``poetry`` `рекомендованым путем <https://python-poetry.org/docs/master/#installation>`_.
uk_ua: Наступним кроком необхідно встановити ``poetry`` `рекомендованим шляхом <https://python-poetry.org/docs/master/#installation>`_.

source: If you use Linux, use command:
ru: Если вы на платформе Linux, используйте команду:
uk_ua: Якщо ви використовуєте Linux, використайте команду:

source: If you use Windows, open PowerShell with admin privilages and use:
ru: Если вы на Windows, откройте PowerShell от имени администратора и используйте:
uk_ua: Якщо ви використовуєте Windows, відкрийте PowerShell від імені адміністратора та використайте:

source: Installing dependencies
ru: Установка зависимостей
uk_ua: Встановлення залежностей

source: Also, for bot working, you need specify which database you will use. For now, we only support ``SQLite``\ , ``MySQL`` and ``PostgreSQL``. For installing required dependence, we need just use argument ``-E`` with lower-cased database name.
ru: Так же для работы бота необходимо указать какую СУБД вы будете использовать. На данный момент мы поддерживаем только ``SQLite``\ , ``MySQL`` и ``PostgreSQL``.Для установки необходимой зависимости, необходимо просто использовать аргумент ``-E`` с названием СУБД в нижнем регистре.
uk_ua: Також, для роботи бота, вам потрібно вказати яку базу даних ви будете використовувати. Зараз ми підтримуємо тільки ``SQLite``\ , ``MySQL`` and ``PostgreSQL``. Для встановлення необхідних залежностей, треба просто використати аргумент ``-E`` з ім'ям бази даних в нижньому регістрі.

source: Example:
ru: Например:
uk_ua: Наприклад:

source: Compiling translations
ru: Компиляция файлов перевода
uk_ua: Компіляція перекладів

source: This requered even if you want just use english.
ru: Это необходимо даже если вы хотите просто использовать английский.
uk_ua: Це потрібно навіть якщо ви хочете використовувати просто англійську.

source: Database migrations
ru: Миграции базы данных
uk_ua: Міграції бази даних

source: Configuration
ru: Конфигурация
uk_ua: Конфігурація

source: All bot configuration happends in ``config.yml``\ , or with enviroment variables. All configuration settings described in `config.py <https://pinger-bot.readthedocs.io/en/latest/autoapi/pinger_bot/config/>`_.
ru: Вся настройка бота происходит в файле ``config.yml``\ , или с помощью переменных окружения. Все настройки описаны в файле `config.py <https://pinger-bot.readthedocs.io/en/latest/autoapi/pinger_bot/config/>`_.
uk_ua: Вся конфігурація бота проходить в ``config.yml``\ , або з допомогою змінних оточення. Всі можливі опції описані в `config.py <https://pinger-bot.readthedocs.io/uk_UA/latest/autoapi/pinger_bot/config/>`_.

source: Database
ru: База данных
uk_ua: База даних

source: When setting up a database, there are a few additional nuances:
ru: При настройке базы данных есть несколько дополнительных нюансов:
uk_ua: Коли встановлюєте базу даних, є також декілька нюансів:

source: If you want use SQLite, you need specify path to file. I recomend set absolute path.
ru: Если вы используете SQLite, вам нужно указать путь к базе данных. Рекомендуется указывать абсолютный путь.
uk_ua: Якщо ви хочете використовувати SQLite, вам потрібно вказати шлях до файлу. Рекомендовано встановлювати абсолютний шлях.

source: What specify in field ``db_uri``\ ? `See this page <https://docs.sqlalchemy.org/en/14/core/engines.html#database-urls>`_.
ru: Чтобы узнать что указывать в поле ``db_uri`` `смотрите эту статью <https://docs.sqlalchemy.org/en/14/core/engines.html#database-urls>`_.
uk_ua: Щоб дізнатися, що треба встановлювати в поле ``db_uri`` `дивіться цю статтю <https://docs.sqlalchemy.org/en/14/core/engines.html#database-urls>`_.

source: Run the bot
ru: Запуск бота
uk_ua: Запуск бота

source: If something is not clear
ru: Если что то не понятно
uk_ua: Якщо щось не зрозуміло

source: You can always write me!
ru: Вы всегда можете написать мне!
uk_ua: Ви завжди можете написати мені!

source: Using in Docker
ru: Использование в Docker
uk_ua: Використання в Docker

source: See `docs <https://pinger-bot.readthedocs.io/en/latest/pages/docker/>`_.
ru: Смотрите отдельную `страницу в документации <https://pinger-bot.readthedocs.io/ru/latest/pages/docker/>`_.
uk_ua: Дивіться `документацію <https://pinger-bot.readthedocs.io/uk_UA/latest/pages/docker/>`_.

source: Updating
ru: Обновление
uk_ua: Оновлення

source: For updating, just redownload repository (do not forget save config and database), if you used ``git`` for donwloading, just run ``git pull``.
ru: Для обновления бота, просто скачайте заново репозиторий (предварительно сохранив конфиги и базу данных), или если выиспользовали ``git`` для установки запустите команду ``git pull``.
uk_ua: Для оновлення, вам просто потрібно пере-скачати репозиторій (не забудьте зберегти конфіг та базу даних), якщо ви використовували ``git`` для скачування, тоді просто використайте ``git pull``.

source: After that, you need update translations and database, commands the same as in installing section:
ru: После чего, нужно обновить переводы и базу данных, шаги аналогичны установке бота:
uk_ua: Після цього, треба оновити переклади і базу даних, команди аналогічні як при встановленні:

source: Thanks
ru: Спасибо
uk_ua: Дякую

source: This project was generated with `fire-square-style <https://github.com/fire-square/fire-square-style>`_. Current template version: `48af418aa475ecb2a51cbd9c398dfa22353f287d <https://github.com/fire-square/fire-square-style/tree/48af418aa475ecb2a51cbd9c398dfa22353f287d>`_. See what `updated <https://github.com/fire-square/fire-square-style/compare/48af418aa475ecb2a51cbd9c398dfa22353f287d...master>`_.
ru: Этот проект был сгенерирован с помощью `fire-square-style <https://github.com/fire-square/fire-square-style>`_. Текущая версия примера: `48af418aa475ecb2a51cbd9c398dfa22353f287d <https://github.com/fire-square/fire-square-style/tree/48af418aa475ecb2a51cbd9c398dfa22353f287d>`_. Смотрите что `обновилось <https://github.com/fire-square/fire-square-style/compare/48af418aa475ecb2a51cbd9c398dfa22353f287d...master>`_ с того времени.

source: Indexes and tables
ru: Индексы и таблицы
uk_ua: Індекси та таблиці

source: `Документація українською <https://pinger-bot.readthedocs.io/uk_UA/latest>`_
uk_ua: `Docs on English <https://pinger-bot.readthedocs.io/en/latest>`_

source: This project was generated with `fire-square-style <https://github.com/fire-square/fire-square-style>`_. Current template version: `fc37baf525159c465d78dc13971f97e2ff906ec7 <https://github.com/fire-square/fire-square-style/tree/fc37baf525159c465d78dc13971f97e2ff906ec7>`_. See what `updated <https://github.com/fire-square/fire-square-style/compare/fc37baf525159c465d78dc13971f97e2ff906ec7...master>`_.
uk_ua: Цей проект був згенерований за допомогою `fire-square-style <https://github.com/fire-square/fire-square-style>`_. Поточна версія шаблону: `fc37baf525159c465d78dc13971f97e2ff906ec7 <https://github.com/fire-square/fire-square-style/tree/fc37baf525159c465d78dc13971f97e2ff906ec7>`_. Дивіться що `оновилося <https://github.com/fire-square/fire-square-style/compare/fc37baf525159c465d78dc13971f97e2ff906ec7...master>`_.
