Repository: PerchunPak/PingerBot
Catalog: docs/locale/*/LC_MESSAGES/pages/changelog.po
Languages: ru, uk_ua

source: Changelog
ru: История изменений
uk_ua: Історія змін

source: We follow `Semantic Versions <https://semver.org/>`_ style.
ru: Мы следуем стандартному стилю `Semantic Versions <https://semver.org/>`_.
uk_ua: Ми слідуємо стилю `Semantic Versions <https://semver.org/>`_.

source: Version 0.4.0
ru: Версия 0.4.0
uk_ua: Версія 0.4.0

source: (branch `master <https://github.com/PerchunPak/PingerBot/tree/master>`_\ )
ru: (ветка `master <https://github.com/PerchunPak/PingerBot/tree/master>`_\ )
uk_ua: (вітка `master <https://github.com/PerchunPak/PingerBot/tree/master>`_\ )

source: Full rewrite.
ru: Полная перепись бота.
uk_ua: Повний перепис.

source: Using ``hikari`` instead of ``discord.py``.
ru: Переход на ``hikari`` вместо ``discord.py``.
uk_ua: Використання ``hikari`` замість ``discord.py``.

source: Using template ``fire-square-style``.
ru: Использовали стиль ``fire-square-style``.
uk_ua: Використання шаблону ``fire-square-style``.

source: Optimize container. `#51 <https://github.com/PerchunPak/pinger-bot/pull/51>`_
ru: Контейнер оптимизирован. `#51 <https://github.com/PerchunPak/pinger-bot/pull/51>`_
uk_ua: Контейнер оптимізовано. `#51 <https://github.com/PerchunPak/pinger-bot/pull/51>`_

source: Version 0.3.0
ru: Версия 0.3.0
uk_ua: Версія 0.3.0

source: (branch `newdb <https://github.com/PerchunPak/PingerBot/tree/newdb>`_\ )
ru: (ветка `newdb <https://github.com/PerchunPak/PingerBot/tree/newdb>`_\ )
uk_ua: (вітка `newdb <https://github.com/PerchunPak/PingerBot/tree/newdb>`_\ )

source: Rewite DB system from ``asyncpg`` to ``sqlalchemy``.
ru: Перепись базы данных с ``asyncpg`` на ``sqlalchemy``.
uk_ua: Перепис системи бази даних з ``asyncpg`` на ``sqlalchemy``.

source: Didn't left from alpha, really unstable, but had good future.
ru: Из альфы не вышло, очень не стабильно, но имело большие надежды.
uk_ua: Не вийшло з альфи, дуже не стабільно, але мало хороше майбутнє.

source: Version 0.2.0
ru: Версия 0.2.0
uk_ua: Версія 0.2.0

source: (branch `rewrite <https://github.com/PerchunPak/PingerBot/tree/rewrite>`_\ )
ru: (ветка `rewrite <https://github.com/PerchunPak/PingerBot/tree/rewrite>`_\ )
uk_ua: (вітка `rewrite <https://github.com/PerchunPak/PingerBot/tree/rewrite>`_\ )

source: In this time better, but anyway, many things not perfect.
ru: В этот раз удачнее, но все еще много чего не идеально.
uk_ua: В цей раз краще, але все одно, багато речей не ідеальні.

source: Version 0.1.0
ru: Версия 0.1.0
uk_ua: Версія 0.1.0

source: (branch `main <https://github.com/PerchunPak/PingerBot/tree/main>`_\ )
ru: (ветка `main <https://github.com/PerchunPak/PingerBot/tree/main>`_\ )
uk_ua: (вітка `main <https://github.com/PerchunPak/PingerBot/tree/main>`_\ )

source: Repository initialised.
ru: Репозиторий инициализирован.
uk_ua: Репозиторій ініціалізовано.

source: First, minimal version, but it is working really bad.
ru: Написана минимальная версия, тем не менее она плохо работает.
uk_ua: Перша, мінімальна версія, але працює дуже погано.
