Repository: PerchunPak/PingerBot
Catalog: docs/locale/*/LC_MESSAGES/pages/docker.po
Languages: ru, uk_ua

source: Using in Docker
ru: Использование в Docker
uk_ua: Використання в Docker

source: Installing
ru: Установка
uk_ua: Встановлення

source: Installing from Dockerhub
ru: Установка из Dockerhub
uk_ua: Встановлення з Dockerhub

source: By default, we create few tags:
ru: По умолчанию, создается несколько тегов:

source: ``latest`` - Latest project release.
ru: ``latest`` - Последний релиз проекта.
uk_ua: ``latest`` - Остання версія проекту.

source: ``dev`` - Latest possible project version. Use only for testing, always can have breaking changes.
ru: ``dev`` - Самая последняя возможная версия проекта. Используйте только для тестирования, всегда могут быть проблемы с несовместимостью версий.

source: ``x.y.z`` - Project release in `Semantic Versions <https://semver.org/>`_ style.
ru: ``x.y.z`` - Релиз проекта в формате `Semantic Versions <https://semver.org/>`_.
uk_ua: ``x.y.z`` - Версія проекту в `Semantic Versions <https://semver.org/>`_.

source: Every of those tags also have duplicates with database suffixes, at now it is can be ``sqlite``, ``mysql`` and ``postgresql``. As example, for tag ``latest`` also will be available tag ``latest-sqlite``.
ru: Каждая из веток имеет так же дубликаты с суффиксами баз данных, на данный момент это могут быть ``sqlite``, ``mysql`` и ``postgresql``. То есть, например, для ветки ``latest`` будет так же доступен контейнер ``latest-sqlite``.

source: Tag without suffix - standard database. At now, it is ``sqlite``. It means that tag ``latest`` give the same as ``latest-sqlite``.
ru: Тег без суффикса - стандартная база данных. На данный момент это ``sqlite``. То есть тег ``latest``, загрузит тоже самое что и при ``latest-sqlite``.

source: There are few deprecated tags, which are still available only for history. It is :ref:`main <pages/changelog:version 0.1.0>`, :ref:`rewrite <pages/changelog:version 0.2.0>` and :ref:`newdb <pages/changelog:version 0.3.0>`.
ru: Есть так же несколько устаревших тегов, которые остаються только для истории. Это :ref:`main <pages/changelog:version 0.1.0>`, :ref:`rewrite <pages/changelog:version 0.2.0>` и :ref:`newdb <pages/changelog:version 0.3.0>`.
uk_ua: Також є декілька застарілих тегів, які залишаються тільки для історії. Це :ref:`main <pages/changelog:version 0.1.0>`, :ref:`rewrite <pages/changelog:version 0.2.0>` та :ref:`newdb <pages/changelog:version 0.3.0>`.

source: If you use not ``sqlite``, you need to apply database migrations manually. In ``sqlite`` migrations are applied automatically while we compile image. See :ref:`index:database migrations` for details.
ru: Если вы используете базу данных не ``sqlite`` - вам нужно самостоятельно применить миграции для нее. В ``sqlite`` миграции применяются при компилировании изображения. Смотрите :ref:`index:database migrations` для инструкции.

source: `Our page on Dockerhub with all available tags. <https://hub.docker.com/r/perchunpak/pingerbot/tags>`_
ru: `Нашу страницу на Dockerhub со списком доступных тегов. <https://hub.docker.com/r/perchunpak/pingerbot/tags>`_
uk_ua: `Наша сторінка на Dockerhub з усіма доступними тегами. <https://hub.docker.com/r/perchunpak/pingerbot/tags>`_

source: Self compilation
ru: Самостоятельная компиляция
uk_ua: Самостійна компіляція

source: Also, you can compile images from project's root.
ru: Вы так же можете самостоятельно скомпилировать все изображения из корневой директории проекта.

source: To do this, you just need to run the command:
ru: Для этого просто необходимо использовать команду:

source: Where ``--build-arg dialect=sqlite`` - parameter, which defines database, what you want to use. Instead of ``sqlite`` you can set any supported.
ru: Где ``--build-arg dialect=sqlite`` - параметр, определяющий базу данных, которую вы хотите использовать. Вместо ``sqlite`` можете подставить любую другую, которая поддерживается.
uk_ua: Де ``--build-arg dialect=sqlite`` - параметер, який визначає яку базу даних ви будете використовувати. Замість ``sqlite`` ви можете встановити що завгодно, що ми підтримуємо.

source: Run
ru: Запуск
uk_ua: Запуск

source: To run the bot, in both cases of installation, use this command:
ru: Для запуска, в обоих случаях установки, используется одна команда:
uk_ua: Для запуску бота, в обох випадках встановлення, використайте цю команду:

source: If you want to use ``sqlite``, you also need to set ``-v YOUR_PATH:/app/pinger_bot.db`` option (Where ``YOUR_PATH`` it is a path your database file. I recommend set absolute path.) This is needed to save database in case of container restart.
ru: Если вы используете базу данных ``sqlite``, вы так же должны указать ``-v YOUR_PATH:/app/pinger_bot.db`` (Где ``YOUR_PATH`` это путь к вашему файлу базы данных, рекомендовано использовать абсолютный путь). Это делается, чтобы иметь возможность сохранять базу данных в случае рестарта контейнера.

source: This parameter **must** be set between ``-d`` flag and ``perchunpak/pingerbot``.
ru: Параметр **нужно** указывать между флагом ``-d`` и ``perchunpak/pingerbot``.

source: You also need to set ``-e`` option for every configuration parameter. This option just set environment variables, interface will be the same as in ``config.yml``, but all parameters keys in upper case.
ru: Вы так же обязательно должны указать всю вашу конфигурацию через ``-e`` флаги. Эти флаги просто устанавливают переменные окружения, так что интерфейс будет аналогичным с ``config.yml``, но все ключи в верхнем регистре.

source: They should be used like ``-e KEY=VALUE``, where ``KEY`` upper cased key from ``config.yml`` (example ``DISCORD_TOKEN``), and ``VALUE`` is a value.
ru: Они идут в формате ``-e KEY=VALUE``, где ``KEY`` это ключ к настройке в верхнем регистре из ``config.yml`` (например ``DISCORD_TOKEN``), а ``KEY`` это значение настройки.
uk_ua: Вони повинні використовуватися як ``-e КЛЮЧ=ЗНАЧЕННЯ``, де ``КЛЮЧ`` це ключ з ``config.yml`` у верхньому регістрі (наприклад ``DISCORD_TOKEN``), і ``ЗНАЧЕННЯ`` це значення.

source: Same as ``-v`` option, they **must** be set between ``-d`` flag and ``perchunpak/pingerbot``.
ru: Как и ``-v`` флаг, они **обязаны** идти между флагом ``-d`` и ``perchunpak/pingerbot``.
uk_ua: Так як і опція ``-v``, воно **повинно** бути між флагом ``-d`` і ``perchunpak/pingerbot``.

source: Since version 0.4.0 the container runs in non-root mode, which means that if you use the sqlite tag and a ``-v`` option you have to give rights to the folder. This can be done with the command ``chown -R 5000:500 <your folder>``.
ru: Начиная с версии 0.4.0 контейнер работает в без-root режиме, что означает, что если вы используете тэг sqlite и опцию ``-v``, вам необходимо предоставить права на папку. Это можно сделать с помощью команды ``chown -R 5000:500 <ваша папка>``.

source: `podman <https://podman.io>`_ as replacement for a Docker.
ru: `podman <https://podman.io>`_ как замену для Docker.
uk_ua: `podman <https://podman.io>`_ як заміну для Docker.

source: Command
ru: Команду
uk_ua: Команду

source: For full list of arguments and possibilities, upper I wrote only basics.
ru: Для большего списка аргументов и возможностей, выше только самое основное.

source: We have few tags:
uk_ua: У нас є декілька тегів:

source: ``dev`` - Latest possible project version. Use this only for testing, it always can have breaking changes.
uk_ua: ``dev`` - Остання можлива версія проекту. Використовуйте лише для тестування, завжди можуть бути проблеми з несумісністю версій.

source: Every of those tags also have duplicates with database suffixes, at now it can be ``sqlite``, ``mysql`` or ``postgresql``. As example, for tag ``latest`` there also will be available tag ``latest-sqlite``.
uk_ua: Кожен з цих тегів, також має дублікати с суфіксами баз даних, на даний момент це можуть бути ``sqlite``, ``mysql`` або ``postgresql``. Як приклад, для тегу ``latest`` також буде доступний тег ``latest-sqlite``.

source: Tag without suffix - standard database. At now, it is ``sqlite``. It means that tag ``latest`` is the same as ``latest-sqlite``.
uk_ua: Тег без суфіксу - стандартна база даних. На даний момент це ``sqlite``. Тобто це означає що тег ``latest`` це теж саме що і ``latest-sqlite``.

source: If you use non-\ ``sqlite`` database, you need to apply database migrations manually. In ``sqlite``, migrations are applied automatically while we compile the image. See :ref:`index:database migrations` for details.
uk_ua: Якщо ви не використовуєте ``sqlite``, вам також треба буде застосовувати міграції бази даних самостійно. В ``sqlite`` міграції приміняються поки ми збираємо зображення. Дивіться :ref:`index:database migrations` для більшої інформації.

source: You can compile images from project's root. To make this, you just need to run the command:
uk_ua: Також, ви можете скомпілювати зображення з кореневої теки проекту. Для цього, просто використайте команду:

source: If you want to use ``sqlite``, you also need to set ``-v YOUR_FOLDER:/app/pinger/data`` option (Where ``YOUR_FOLDER`` it is a folder with your database file. I recommend to set absolute path.) This is needed to save database in case of container restart. This parameter **must** be set between ``-d`` flag and ``perchunpak/pingerbot``.
uk_ua: Якщо ви хочете використовувати ``sqlite``, ви також повинні встановити опцію ``-v ВАША_ТЕКА:/app/data`` (Де ``ВАША_ТЕКА`` це ваша тека до теки з базою даних, рекомендовано встановлювати абсолютний шлях.) Це потрібно щоб зберігати вашу базу даних коли контейнер перезавантажиться.

source: You also have to set ``-e`` option for every configuration parameter. This option just set environment variables, interface will be the same as in ``config.yml``, but all parameters keys in upper case.
uk_ua: Вам також треба встановити опцію ``-e`` для кожного параметра конфігурації. Ця опція просто встановлює зміни оточення, так що інтерфейс буде такий самий як і в ``config.yml``, але всі ключі параметрів повинні бути у верхньому регістрі.

source: Since version 0.4.0 the container runs in non-root mode, which means that if you use the sqlite tag and a ``-v`` option, you have to give rights to the folder. This can be done with the command ``chown -R 5000:5000 <your folder>``.
uk_ua: З версії 0.4.0 контейнер запускається в режимі без-root, що означає, що якщо ви використовуєте тег sqlite і ``-v`` опцію, вам потрібно надати права на папку. Це можна зробити за допомогою команди ``chown -R 5000:5000 <ваша тека>``.

source: This doesn't apply to Windows users.
uk_ua: Не стосується користувачів Windows.

source: For full list of arguments and possibilities, upper are only basics.
uk_ua: Для повного списку аргументів та можливостей, вище тільки саміоснови.
